using System;
/*Лич Сандро проводит свои научные исследования в магии огня. 
 * Сандро стоит в центре огромного квадратного зала площадью 1030 квадратных километров, 
 * сплошь замощённого квадратными каменными плитами со стороной один метр. 
 * По взмаху посоха вокруг Сандро возникает огненный круг радиуса R метров. 
 * Центр круга совпадает с центром зала и находится в месте соприкосновения четырёх плит. 
 * Сандро хочет посчитать, сколько плит будет испорчено огнем. Считается, что плита испорчена, 
 * если она имеет хотя бы две общие точки с кругом. 
 * На рисунке в качестве примера изображены плиты, испорченные огненным кругом радиуса 4:*/

namespace Lesson5.Arr7
{
    internal class Program
    {
        static void Main(string[] args)
        {
            var n = int.Parse(Console.ReadLine());
            Arr7(n);
        }

        static void Arr7(int n)
        {
            
        }
    }
}
