using System;
/*
 * Самолёт должен набрать высоту h метров в течение первых t секунд полёта и удерживать её в течение всего полёта. 
 * Разрешён набор высоты со скоростью не более чем v метров в секунду. До полного набора высоты запрещено снижаться. 
 * Известно, что уши заложены в те и только те моменты времени, когда самолёт поднимается со скоростью более x метров в секунду. 
 * Посчитайте минимальное и максимальное возможное время, в течение которого у пассажиров будут заложены уши. 
 * Считайте, что самолёт способен изменять скорость мгновенно.
 */

namespace Lesson2.Expr12
{
    internal class Program
    {
        static void Main(string[] args)
        {

        }
        static void Expr12()
        {

        }
    }
}
